{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задание 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Напишите программу по оценке экзаменационных результатов пользователей на основе введенных баллов (максимум 100 баллов).\n",
    "\n",
    "1. Если пользователь набрал 90 баллов и выше - получает оценку \"Отлично\".\n",
    "2. Оценка \"Хорошо\" начинается от 70 баллов (включительно).\n",
    "3. Оценка \"Удовлетворительно\" от 50 баллов (включительно).\n",
    "4. Если оценка ниже - то экзамен считается проваленным, предложите пользователю прийти на пересдачу.\n",
    "\n",
    "Необходимо реализовать проверку введенных пользователем данных, что это числа, а не буквы, и что числа находятся в диапазоне от 0 до 100."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите количество баллов (0-100): gdg\n",
      "Ошибка: Введите числовое значение.\n"
     ]
    }
   ],
   "source": [
    "score = input(\"Введите количество баллов: \")\n",
    "\n",
    "if score.isdigit():\n",
    "    score = int(score)\n",
    "    if score >= 90 and score <= 100:\n",
    "        print(\"Оценка: Отлично\")\n",
    "    elif score >= 70 and score < 90:\n",
    "        print(\"Оценка: Хорошо\")\n",
    "    elif score >= 50 and score < 70:\n",
    "        print(\"Оценка: Удовлетворительно\")\n",
    "    elif score >= 0 and score < 50:\n",
    "        print(\"Экзамен провален. Рекомендуем прийти на пересдачу.\")\n",
    "    else:\n",
    "      print(\"Ошибка: Введите число в диапазоне от 0 до 100.\")\n",
    "else:\n",
    "   print(\"Ошибка: Введите числовое значение.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задание 2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Выполните задание 1, но с применение pattern matching"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите количество баллов: 43\n",
      "Экзамен провален. Рекомендуем прийти на пересдачу.\n"
     ]
    }
   ],
   "source": [
    "score = input(\"Введите количество баллов: \")\n",
    "\n",
    "if score.isdigit():\n",
    "    score = int(score)\n",
    "    match score:\n",
    "        case _ if 90 <= score <= 100:\n",
    "            print(\"Оценка: Отлично\")\n",
    "        case _ if 70 <= score < 90:\n",
    "            print(\"Оценка: Хорошо\")\n",
    "        case _ if 50 <= score < 70:\n",
    "            print(\"Оценка: Удовлетворительно\")\n",
    "        case _ if 0 <= score < 50:\n",
    "            print(\"Экзамен провален. Рекомендуем прийти на пересдачу.\")\n",
    "        case _:\n",
    "            print(\"Ошибка: Введите число в диапазоне от 0 до 100.\")\n",
    "else:\n",
    "    print(\"Ошибка: Введите числовое значение.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задание 3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Машины по очереди заезжают на парковку, пока в ней есть свободные места. Вместимость парковки 8 авто.\n",
    "\n",
    "Используя цикл `while`, каждый заезд очередной машины сопроводите сообщением `\"Машина заехала\"`. Выведите на экран количество свободных мест на парковке после заезда очередной машины.\n",
    "\n",
    "Когда парковка окажется полной - сообщите остальным автовладельцам, что места в ней больше нет"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Машина заехала\n",
      "Машина заехала\n",
      "Машина заехала\n",
      "Машина заехала\n",
      "Машина заехала\n",
      "Машина заехала\n",
      "Машина заехала\n",
      "Машина заехала\n",
      "Места на парковке больше нет\n"
     ]
    }
   ],
   "source": [
    "max_car_in_park = 8\n",
    "count_car_in_park = 0\n",
    "\n",
    "while True:\n",
    "  if count_car_in_park < max_car_in_park:\n",
    "    print('Машина заехала')\n",
    "    count_car_in_park += 1\n",
    "  else:\n",
    "    print('Места на парковке больше нет')\n",
    "    break\n",
    "\n",
    "\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
